import json

import pytest

from src.top_transactions import top_transactions


@pytest.fixture
def sample_transactions() -> list:

    return [
        {
            "Дата платежа": "2023-01-01",
            "Сумма платежа": 1000,
            "Категория": "Еда",
            "Описание": "Ужин",
            "Номер карты": "1234567890123456",
        },
        {
            "Дата платежа": "2023-01-02",
            "Сумма платежа": 2000,
            "Категория": "Транспорт",
            "Описание": "Такси",
            "Номер карты": "1234567890123456",
        },
        {
            "Дата платежа": "2023-01-03",
            "Сумма платежа": 1500,
            "Категория": "Развлечения",
            "Описание": "Кино",
            "Номер карты": "1234567890123456",
        },
        {
            "Дата платежа": "2023-01-04",
            "Сумма платежа": 500,
            "Категория": "Еда",
            "Описание": "Завтрак",
            "Номер карты": None,
        },
        {
            "Дата платежа": "2023-01-05",
            "Сумма платежа": 3000,
            "Категория": "Шопинг",
            "Описание": "Одежда",
            "Номер карты": "1234567890123456",
        },
        {
            "Дата платежа": "2023-01-06",
            "Сумма платежа": 2500,
            "Категория": "Развлечения",
            "Описание": "Концерт",
            "Номер карты": "1234567890123456",
        },
    ]


def test_top_transactions(sample_transactions: str) -> None:

    expected_output = [
        {"Дата платежа": "2023-01-05", "Сумма платежа": 3000, "Категория": "Шопинг", "Описание": "Одежда"},
        {"Дата платежа": "2023-01-06", "Сумма платежа": 2500, "Категория": "Развлечения", "Описание": "Концерт"},
        {"Дата платежа": "2023-01-02", "Сумма платежа": 2000, "Категория": "Транспорт", "Описание": "Такси"},
        {"Дата платежа": "2023-01-03", "Сумма платежа": 1500, "Категория": "Развлечения", "Описание": "Кино"},
        {"Дата платежа": "2023-01-01", "Сумма платежа": 1000, "Категория": "Еда", "Описание": "Ужин"},
    ]

    result = top_transactions(sample_transactions)
    result_json = json.loads(result)

    assert result_json == expected_output
